foam-volume/OpenFOAM/openfoam-v2506/run/h42/0/U
/*--------------------------------*- C++ -*----------------------------------*    | =========                 |                                                 |
    | \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  v2006                                 |
    |   \  /    A nd           | Website:  www.openfoam.com                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       volVectorField;
        object      U;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    
    dimensions      [0 1 -1 0 0 0 0];
    
    internalField   uniform (16.683 0 0);
    
    boundaryField
    {
    bottom
    {
        type            noSlip;
    }
    "(top|outlet)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
		value 			nonuniform List<vector>
    
    175 (
...
    }
           

     
    }
    // ************************************************************************* //