foam-volume/OpenFOAM/openfoam-v2506/run/h42/0/k
/*--------------------------------*- C++ -*----------------------------------*    | =========                 |                                                 |
    | \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  v2006                                 |
    |   \  /    A nd           | Website:  www.openfoam.com                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       volScalarField;
        object      k;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    
    dimensions      [0 2 -2 0 0 0 0];
    
    internalField   uniform .16699;
    
boundaryField
{
    bottom
    {
        type            kLowReWallFunction;
        value           $internalField;

    }
    "(top|outlet)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
		value 			nonuniform List<scalar> 
    
    175 (
...
    }
     
    }
    // ************************************************************************* //